Autodesk.Revit.DB.Analysis.MassZoneMaterialType
MassZone material type.
Remarks:
Indicates how MassZone material is calculated.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZoneMaterialType.NormalMaterial
If materialId is InvalidElementId, all faces of the MassZone will use the material from the MassZone category object style.
If materialId is a valid material, all faces of the MassZone will use that specific material.

Autodesk.Revit.DB.Analysis.MassZoneMaterialType.MaterialBySurfaceType
Material for a given face of a MassZone comes from the category of the face of the MassEnergyAnalyticalModel that the MassZone face is created from.